/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: config.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: 板级配置头文件
*********************************************************************************************************/

#ifndef __BSP_CONFIG_H
#define __BSP_CONFIG_H

/*********************************************************************************************************
  板级配置头文件
*********************************************************************************************************/

#if defined(IOT_PI_V1)

#include "src/board/IOT_PI_V1/iot_pi_v1_cfg.h"

#elif defined(IOT_PI)

#include "src/board/IOT_PI/iot_pi_cfg.h"

#elif defined(CSG_SMART_METER)

#include "src/board/CSG_SMART_METER/csg_smart_meter_cfg.h"

#elif defined(ALIENTEK_APOLLO_F429)

#include "src/board/ALIENTEK_APOLLO_F429/alientek_apollo_f429_cfg.h"

#endif

#endif                                                                  /*  __BSP_CONFIG_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
