/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: stm32_drv_audio.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: STM32 芯片 AUDIO 驱动头文件
*********************************************************************************************************/

#ifndef STM32_DRV_AUDIO_H
#define STM32_DRV_AUDIO_H

#ifdef __cplusplus
extern "C" {
#endif

ms_err_t stm32_audio_drv_register(void);
ms_err_t stm32_audio_dev_register(const char *path);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  STM32_DRV_AUDIO_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
