/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: stm32_drv_spi_nor.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: STM32 芯片 SPI NOR 驱动头文件
*********************************************************************************************************/

#ifndef STM32_DRV_SPI_NOR_H
#define STM32_DRV_SPI_NOR_H

#ifdef __cplusplus
extern "C" {
#endif

ms_err_t stm32_spi_nor_dev_init(const char *path, const char *mnt_path);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  STM32_DRV_SPI_NOR_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
