/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: stm32_drv_netif.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: STM32 芯片 NETIF 驱动头文件
*********************************************************************************************************/

#ifndef STM32_DRV_NETIF_H
#define STM32_DRV_NETIF_H

#ifdef __cplusplus
extern "C" {
#endif

#include "lwip/err.h"
#include "lwip/netif.h"
#include "lwip/tcpip.h"

err_t ethernetif_init(struct netif *netif);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  STM32_DRV_NETIF_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
